src/test/resources/Request_2.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <env:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" env:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>anan54@levistraussandco_preview</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Load@098</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </env:Header>
    <env:Body>
        <wd:Get_Integration_Events_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v29.2">
            <wd:Request_References>
                <wd:Integration_Event_Reference>
                    <wd:ID wd:type="Background_Process_Instance_ID">INTEGRATION_ESB_INVOCATION-9-960917</wd:ID>
                </wd:Integration_Event_Reference>
            </wd:Request_References>
        </wd:Get_Integration_Events_Request>
    </env:Body>
</env:Envelope>